In [2]:
import pandas as pd
df = pd.read_csv('C:\\Users\\ADMIN\\Downloads\\GDPlist.csv', encoding = "ISO-8859-1" )
df.head()

        Country      Continent  GDP (millions of US$)
0   Afghanistan           Asia                  18181
1       Albania         Europe                  12847
2       Algeria         Africa                 190709
3        Angola         Africa                 100948
4     Argentina  South America                 447644

In [29]:
print("Số dòng của bộ dữ liệu là: ",df.shape[0])
print("Số cột của bộ dữ liệu là: ",df.shape[1])
print("Kiểu dữ liệu của các thuộc tính:")
print(df.dtypes)

Số dòng của bộ dữ liệu là:  23
Số cột của bộ dữ liệu là:  4

In [4]:
df = df.rename(columns={'Country':'Nuoc','Continent':'ChauLuc','GDP (millions of US$)':'GDP (trieu $)'})
df.head()

           Nuoc        ChauLuc  GDP (trieu $)
0   Afghanistan           Asia          18181
1       Albania         Europe          12847
2       Algeria         Africa         190709
3        Angola         Africa         100948
4     Argentina  South America         447644

In [5]:
df.insert(df.columns.get_loc('Nuoc') + 1, 'Thanhpho', pd.Series('', index=df.index))
df.head()

           Nuoc Thanhpho        ChauLuc  GDP (trieu $)
0   Afghanistan                    Asia          18181
1       Albania                  Europe          12847
2       Algeria                  Africa         190709
3        Angola                  Africa         100948
4     Argentina           South America         447644

In [19]:
df['Thanhpho'] = df['Thanhpho'].replace({'Vietnam': 'Hanoi'})

In [31]:
df = df.drop(df.loc[df.ChauLuc == 'Asia'].index)

In [32]:
df = df.drop(df.loc[df['GDP (trieu $)'] < 300000].index)

In [33]:
print(df)

                Nuoc         Thanhpho        ChauLuc  GDP (trieu $)
4          Argentina        Argentina  South America         447644
5          Australia        Australia        Oceania        1488221
6            Austria          Austria         Europe         419243
11           Belgium          Belgium         Europe         513396
15            Brazil           Brazil  South America        2492908
21            Canada           Canada  North America        1736869
24          Colombia         Colombia  South America         328422
32           Denmark          Denmark         Europe         333238
41            France           France         Europe        2776324
44           Germany          Germany         Europe        3577031
46            Greece           Greece         Europe         303065
58             Italy            Italy         Europe        2198730
73            Mexico           Mexico  North America        1154784
78       Netherlands      Netherlands         Europe         840433
81            Norway           Norway         Europe         483650
89            Poland           Poland         Europe         513821
100     South Africa     South Africa         Africa         408074
102            Spain            Spain         Europe        1493513
105           Sweden           Sweden         Europe         538237
106      Switzerland      Switzerland         Europe         636059
117   United Kingdom   United Kingdom         Europe        2417570
118    United States    United States  North America       15094025
121        Venezuela        Venezuela  South America         315841